Documents/Requests/Soap_Getcustomerdetails_DSL_mo_23_02_2022_15_27_39_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/customer/VFDEGetCustomerDetails" xmlns:vfd1="http://amdocs/vfde/customer/VFDEGetCustomerDetailsInput">
    <soapenv:Header/>
    <soapenv:Body>
        <vfd:GetCustomerDetailsRequest>
            <vfd1:ROOT>
                <Event>
                    <Type>RetrieveCustomerInfo</Type>
                   <ID>96c01ece-d50b-4725-800d-4d304d1748a5</ID>
                    <CallerID>OSF</CallerID>
                    <CorrelationID>0da34705-36ea-4847-9587-608c8ce488d8</CorrelationID>
                    <MessageCreationTimestamp>2022-02-23T06:04:48.247Z</MessageCreationTimestamp>
                </Event>
                <DATA>
                    <GlobalID>FN_</GlobalID>
                    <Mode>3</Mode>
                    <SourceSystemID>OSF.TCP</SourceSystemID>
                    <Portal>{{portal}}</Portal>
                </DATA>
            </vfd1:ROOT>
        </vfd:GetCustomerDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>